/*
 -- ============================================================================
 -- FILE NAME	: spm.h
 -- DESCRIPTION : ¥¹¥¯¥é¥Ã¥Á¥Ñ¥Ã¥É¥á¥â¥ê¥Ø¥Ã¥À
 -- ----------------------------------------------------------------------------
 -- Revision  Date		  Coding_by	 Comment
 -- 1.0.0	  2011/06/27  suito		 ÐÂÒŽ×÷³É
 -- ============================================================================
*/

`ifndef __SPM_HEADER__
	`define __SPM_HEADER__			  // ¥¤¥ó¥¯¥ë©`¥É¥¬©`¥É

/*
 * ¡¾SPM¤Î¥µ¥¤¥º¤Ë¤Ä¤¤¤Æ¡¿
 * ?SPM¤Î¥µ¥¤¥º¤ò‰ä¸ü¤¹¤ë¤Ë¤Ï¡¢
 *	 SPM_SIZE¡¢SPM_DEPTH¡¢SPM_ADDR_W¡¢SpmAddrBus¡¢SpmAddrLoc¤ò‰ä¸ü¤·¤ÆÏÂ¤µ¤¤¡£
 * ?SPM_SIZE¤ÏSPM¤Î¥µ¥¤¥º¤ò¶¨Áx¤·¤Æ¤¤¤Þ¤¹¡£
 * ?SPM_DEPTH¤ÏSPM¤ÎÉî¤µ¤ò¶¨Áx¤·¤Æ¤¤¤Þ¤¹¡£
 *	 SPM¤Î·ù¤Ï»ù±¾µÄ¤Ë32bit£¨4Byte£©¹Ì¶¨¤Ê¤Î¤Ç¡¢
 *	 SPM_DEPTH¤ÏSPM_SIZE¤ò4¤Ç¸î¤Ã¤¿‚Ž¤Ë¤Ê¤ê¤Þ¤¹¡£
 * ?SPM_ADDR_W¤ÏSPM¤Î¥¢¥É¥ì¥¹·ù¤ò¶¨Áx¤·¤Æ¤ª¤ê¡¢
 *	 SPM_DEPTH¤òlog2¤·¤¿‚Ž¤Ë¤Ê¤ê¤Þ¤¹¡£
 * ?SpmAddrBus¤ÈSpmAddrLoc¤ÏSPM_ADDR_W¤Î¥Ð¥¹¤Ç¤¹¡£
 *	 SPM_ADDR_W-1:0¤È¤·¤ÆÏÂ¤µ¤¤¡£
 *
 * ¡¾SPM¤Î¥µ¥¤¥º¤ÎÀý¡¿
 * ?SPM¤Î¥µ¥¤¥º¤¬16384Byte£¨16KB£©¤ÎˆöºÏ¡¢
 *	 SPM_DEPTH¤Ï16384¡Â4¤Ç4096
 *	 SPM_ADDR_W¤Ïlog2(4096)¤Ç12¤È¤Ê¤ê¤Þ¤¹¡£
 */

	`define SPM_SIZE   4096 // SPMï¿½Î¥ï¿½ï¿½ï¿½ï¿½ï¿½
	`define SPM_DEPTH  1024 // SPMï¿½ï¿½ï¿½î¤µ
	`define SPM_ADDR_W 10	 // ï¿½ï¿½ï¿½É¥ì¥¹ï¿½ï¿½
	`define SpmAddrBus 9:0	 // ï¿½ï¿½ï¿½É¥ì¥¹ï¿½Ð¥ï¿½
	`define SpmAddrLoc 9:0	 // ï¿½ï¿½ï¿½É¥ì¥¹ï¿½ï¿½Î»ï¿½ï¿½

`endif

