/*
 -- ============================================================================
 -- FILE NAME	: rom.h
 -- DESCRIPTION : ROM ¥Ø¥Ã¥À
 -- ----------------------------------------------------------------------------
 -- Revision  Date		  Coding_by	 Comment
 -- 1.0.0	  2011/06/27  suito		 ÐÂÒŽ×÷³É
 -- ============================================================================
*/

`ifndef __ROM_HEADER__
	`define __ROM_HEADER__			  // ¥¤¥ó¥¯¥ë©`¥É¥¬©`¥É

/*
 * ¡¾ROM¤Î¥µ¥¤¥º¤Ë¤Ä¤¤¤Æ¡¿
 * ?ROM¤Î¥µ¥¤¥º¤ò‰ä¸ü¤¹¤ë¤Ë¤Ï¡¢
 *	 ROM_SIZE¡¢ROM_DEPTH¡¢ROM_ADDR_W¡¢RomAddrBus¡¢RomAddrLoc¤ò‰ä¸ü¤·¤ÆÏÂ¤µ¤¤¡£
 * ?ROM_SIZE¤ÏROM¤Î¥µ¥¤¥º¤ò¶¨Áx¤·¤Æ¤¤¤Þ¤¹¡£
 * ?ROM_DEPTH¤ÏROM¤ÎÉî¤µ¤ò¶¨Áx¤·¤Æ¤¤¤Þ¤¹¡£
 *	 ROM¤Î·ù¤Ï»ù±¾µÄ¤Ë32bit£¨4Byte£©¹Ì¶¨¤Ê¤Î¤Ç¡¢
 *	 ROM_DEPTH¤ÏROM_SIZE¤ò4¤Ç¸î¤Ã¤¿‚Ž¤Ë¤Ê¤ê¤Þ¤¹¡£
 * ?ROM_ADDR_W¤ÏROM¤Î¥¢¥É¥ì¥¹·ù¤ò¶¨Áx¤·¤Æ¤ª¤ê¡¢
 *	 ROM_DEPTH¤òlog2¤·¤¿‚Ž¤Ë¤Ê¤ê¤Þ¤¹¡£
 * ?RomAddrBus¤ÈRomAddrLoc¤ÏROM_ADDR_W¤Î¥Ð¥¹¤Ç¤¹¡£
 *	 ROM_ADDR_W-1:0¤È¤·¤ÆÏÂ¤µ¤¤¡£
 *
 * ¡¾ROM¤Î¥µ¥¤¥º¤ÎÀý¡¿
 * ?ROM¤Î¥µ¥¤¥º¤¬8192Byte£¨4KB£©¤ÎˆöºÏ¡¢
 *	 ROM_DEPTH¤Ï8192¡Â4¤Ç2048
 *	 ROM_ADDR_W¤Ïlog2(2048)¤Ç11¤È¤Ê¤ê¤Þ¤¹¡£
 */

	`define ROM_SIZE   4096 // ROMï¿½Î¥ï¿½ï¿½ï¿½ï¿½ï¿½
	`define ROM_DEPTH  1024 // ROMï¿½ï¿½ï¿½î¤µ
	`define ROM_ADDR_W 10	// ï¿½ï¿½ï¿½É¥ì¥¹ï¿½ï¿½
	`define RomAddrBus 9:0 // ï¿½ï¿½ï¿½É¥ì¥¹ï¿½Ð¥ï¿½
	`define RomAddrLoc 9:0 // ï¿½ï¿½ï¿½É¥ì¥¹ï¿½ï¿½Î»ï¿½ï¿½

`endif

